app/Modules/AssetManagement/Models/AssetManagementModel.php

SELECT `asset_management`.*, `jenis_perangkat`.`nama_jenis_perangkat`, `merk_perangkat`.`nama_merk`, `lokasi_pemasangan`.`nama_lokasi`, `status_asset`.`nama_status`
FROM `asset_management`
LEFT JOIN `jenis_perangkat` ON `jenis_perangkat`.`id_jenis` = `asset_management`.`jenis_perangkat`
LEFT JOIN `merk_perangkat` ON `merk_perangkat`.`id_merk` = `asset_management`.`merk`
LEFT JOIN `lokasi_pemasangan` ON `lokasi_pemasangan`.`id_lokasi` = `asset_management`.`lokasi_perangkat`
LEFT JOIN `status_asset` ON `status_asset`.`id_status` = `asset_management`.`status`
ORDER BY `id_asset` DESC
---
    public function getAll()
    {
        return $this->select('asset_management.*, jenis_perangkat.nama_jenis_perangkat, merk_perangkat.nama_merk, lokasi_pemasangan.nama_lokasi, status_asset.nama_status')
            ->join('jenis_perangkat', 'jenis_perangkat.id_jenis = asset_management.jenis_perangkat', 'left')
            ->join('merk_perangkat', 'merk_perangkat.id_merk = asset_management.merk', 'left')
            ->join('lokasi_pemasangan', 'lokasi_pemasangan.id_lokasi = asset_management.lokasi_perangkat', 'left')
            ->join('status_asset', 'status_asset.id_status = asset_management.status', 'left')
            ->orderBy('id_asset', 'DESC')
            ->get()
            ->getResult();