app/Modules/MasterData/Controllers/JenisPerangkatController.php

    public function index()
    {
        $data['jenis_perangkat'] = $this->jenisperangkatModel->findAll();
---
SELECT *
FROM `jenis_perangkat`

    public function displayData()
    {
        $jenisPerangkat = $this->jenisperangkatModel->findAll();
---
SELECT *
FROM `jenis_perangkat`