app/Modules/AssetManagement/Controllers/AssetManagementController.php

    public function index()
    {
        $data['asset_management']   = $this->assetmanagementModel->getAll();
        // print_r($data['asset_management']);
        // die();
        $data['jenis_perangkat']    = $this->jenisperangkatModel->findAll();
        $data['merk_perangkat']     = $this->merkperangkatModel->findAll();

        $data['lokasi_pemasangan']  = $this->lokasiperangkatModel->findAll();
        $data['ruang_shaft']        = $this->lokasiperangkatModel->getRuangShaft();
        $data['gkp']                = $this->lokasiperangkatModel->getGkp();
        $data['gudang']             = $this->lokasiperangkatModel->getGudang();

        $data['status_asset']       = $this->statusassetModel->findAll();
---
SELECT *
FROM `jenis_perangkat`
SELECT *
FROM `merk_perangkat`
SELECT *
FROM `lokasi_pemasangan`
SELECT *
FROM `status_asset`

    public function store()
    {
        // simpan data jika validasi berhasil
        $this->assetmanagementModel->save([
            'jenis_perangkat' => $this->request->getPost('jenis_perangkat'),
            'merk' => $this->request->getPost('merk'),
            'tipe' => $this->request->getPost('tipe'),
            'serial_no' => $this->request->getPost('serial_no'),
            'no_asset' => $this->request->getPost('no_asset'),
            'lokasi_perangkat' => $this->request->getPost('lokasi_perangkat'),
            'status' => $this->request->getPost('status'),
            'catatan' => $this->request->getPost('catatan')
        ]);
---
INSERT INTO `asset_management` (`jenis_perangkat`, `merk`, `tipe`, `serial_no`, `no_asset`, `lokasi_perangkat`, `status`, `catatan`) VALUES ('1', '1', 'XYZ1000', '9009', '88989', '20', '3', 'Percobaan')

    public function update($id)
    {
        // Update data jika validasi berhasil
        $this->assetmanagementModel->update($id, [
            'jenis_perangkat' => $this->request->getPost('jenis_perangkat'),
            'merk' => $this->request->getPost('merk'),
            'tipe' => $this->request->getPost('tipe'),
            'serial_no' => $this->request->getPost('serial_no'),
            'no_asset' => $this->request->getPost('no_asset'),
            'lokasi_perangkat' => $this->request->getPost('lokasi_perangkat'),
            'status' => $this->request->getPost('status'),
            'catatan' => $this->request->getPost('catatan')
        ]);
---
UPDATE `asset_management` SET `jenis_perangkat` = '2', `merk` = '4', `tipe` = 'XZY90', `serial_no` = '09009', `no_asset` = '09090', `lokasi_perangkat` = '10', `status` = '2', `catatan` = 'Percobaan'
WHERE `asset_management`.`id_asset` IN ('71')