app/Modules/User/Models/UserModel.php

UPDATE `users` SET `last_login` = '2024-10-29 02:29:07', `ip_address` = '::1'
WHERE `users`.`id` IN ('1')
---
    public function updateLoginInfo($id, $ipAddress)
    {
        return $this->update($id, [
            'last_login' => date('Y-m-d H:i:s'),
            'ip_address' => $ipAddress,
        ]);